// component/communityInformation/myHistory/myHistory.js
Component({
  /**
   * 组件的属性列表
   */
  properties: {

  },

  /**
   * 组件的初始数据
   */
  data: {
    history:[{
        title: "网站2.0上线",
        date: "2017/09",
        content: "新版2.0网站全新上线发布"
      },
      {
        title: "数模联盟网络会议第一次",
        date: "2012/10",
        content: "广西高校数学建模协会联盟组建工作筹备组召开了第一次网络会议，会议由筹备组组长李亮主持"
      },{
        title: "杂志社和基地试运营",
        date: "2012/08",
        content: "桂林理工大学数学杂志社、桂林理工大学数学建模基地成立并进入试运营阶段"
      },{
        title: "第三次改革",
        date: "2012/08",
        content: "完成了第三次改革，为协会日后稳定快速发展奠定了最坚实的基础"
      },{
        title: "桂林数模交流会",
        date: "2012/05",
        content: "在我校成功主办“桂林地区数学建模协会第一次合作交流会”"
      },{
        title: "协会标志换新",
        date: "2012/05",
        content: "更换会徽、会旗、工作牌等重大协会标志。会徽、会旗由名誉会长李亮设计，工作牌由第七任会长李春勇设计。"
      },{
        title: "网站上线",
        date: "2011/10",
        content: "桂林理工大学数学建模协会网站正式上线。网站由名誉会长李亮建设并维护，是全校第一个学生组织独立网站”"
      },{
        title: "全国高校数模联盟",
        date: "2011/10",
        content: "我会联合100多所高校发起成立全国高校数学建模协会联盟，成为第一发起单位"
      },{
        title: "成立信息部",
        date: "2011/08",
        content: "增设信息部，由李有余担任第一任部长"
      },{
        title: "二次改革",
        date: "2011/08",
        content: "进行第二次改革，进一步完善组织结构"
      },{
        title: "一次改革",
        date: "2010/11",
        content: "举行第一次重大内部改革，推动我会全面改革发展浪潮"
      },{
        title: "编修协会章程",
        date: "2010/08",
        content: "时任团支书李亮第一次完整编修协会章程"
      },{
        title: "举办第一届夺宝奇兵",
        date: "2010/04",
        content: "举办第一届“夺宝奇兵”活动。该活动一举成为我会最具代表性的精品活动"
      },{
        title: "第六届我校数学竞赛",
        date: "2010/04",
        content: "承办第六届桂林理工大学数学竞赛暨2010年全国数学建模竞赛选拔赛"
      },{
        title: "升级为校级社团",
        date: "2009/10",
        content: "数学建模协会升格为首批校级社团"
      },{
        title: "第五届我校数学竞赛",
        date: "2009/06",
        content: "承办学校第五届数学竞赛暨2009年全国数学建模竞赛选拔赛"
      },{
        title: "搬迁",
        date: "2007/11",
        content: "数学建模协会主体搬迁至雁山校区"
      },{
        title: "协会成立",
        date: "2005/11",
        content: "数学建模协会在屏风校区正式注册成立"
      },{
      title: "协会前身",
      date: "2003/03",
      content: "数学爱好者团体出现，即数学建模协会前身。该团体为日后数学建模协会成立及发展奠定了坚实的兴趣与学术基础"
    }]
  },

  /**
   * 组件的方法列表
   */
  methods: {

  }
})
