// component/communityInformation/myAbout/myAbout.js
Component({
  /**
   * 组件的属性列表
   */
  properties: {

  },

  /**
   * 组件的初始数据
   */
  data: {
    aboutTitle: "数学建模协会",
    aboutContent:[
      {content:"桂林理工大学数学建模协会起源于2003年，2005年正式注册成立，2007年搬迁至雁山校区，于2008年成为首批校级协会，系理学院（原数理系）所属社团。"},
      {content:"是广西十大明星社团，广西优秀大学生社团，校五星级社团，全国高校数学建模协会联盟第一发起社团，全国第一个拥有逾7万字全面的文化与工作手册的学生社团，广西第一个以企业管理优化模式进行改革和发展的学生社团。"},
      {content:"是全校学术性最浓、专业性最强、影响力最广、获奖次数最多的学术科技类社团之一"},
      {content:"在各类竞赛中累计荣获国家级61项、区级192项"},
      // {content:"便于拷贝"}
    ],
  },

  /**
   * 组件的方法列表
   */
  methods: {

  }
})
